УчетВУправляющихДляГит1/src/ExchangePlans/ОбменУправлениеТорговлей103БухгалтерияПредприятия30/ОбменУправлениеТорговлей103БухгалтерияПредприятия30.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="7fa9a6f8-9895-4cb1-a56c-eb8a027efb05">
  <name>ОбменУправлениеТорговлей103БухгалтерияПредприятия30</name>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю</name>
    <type>
      <types>EnumRef.ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <comment>Передавать данные только по выбранным организациям</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладДляОбменаДаннымиСУТ</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПриНеобходимости</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиОбъектов</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

УчетВУправляющихДляГит1/src/Enums/ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю/ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю</name>
  <comment>Выгрузка документов заказ покупателя счет на оплату</comment>
  <enumValues>
    <name>НеВыгружать</name>
    <comment>Документы &quot;Заказ покупателя&quot;, &quot;Счет на оплату&quot; не выгружаются</comment>
  </enumValues>
  <enumValues>
    <name>ЗаказПокупателя</name>
    <comment>Выгружается документ &quot;Заказ покупателя&quot;</comment>
  </enumValues>
  <enumValues>
    <name>СчетНаОплатуПокупателю</name>
    <comment>Выгружается документ &quot;Счет на оплату&quot;</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/ExchangePlans/ОбменУправлениеТорговлей103БухгалтерияПредприятия30/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ИспользоватьОтборПоОрганизациям Тогда
		Организации.Очистить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю) Тогда
		ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Перечисления.ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю.НеВыгружать;
	КонецЕсли;
	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	Если НЕ ЗначениеЗаполнено(РежимВыгрузкиОбъектов) тогда
		РежимВыгрузкиОбъектов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьОбъект(ДанныеЗаполнения);
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОбъект(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
